var local_database = [
  {
    date: "Sep 18 2016",
    title: "发掘更好的自己，才能遇见最好的别人",
    imgSrc: "/images/post/crab.png",
    avatar: "/images/avatar/1.png",
    content: "记忆深处里，小时候体育课上，老师组织我们男生搞了一个跳高比赛，标竿上升到90厘米时，总有几个男生跳不过，这样就受到别的同学一片嘘声，再这嘘声中，也有无地自容的我，因为我正是这跳不过的男生当中的一个。",
    reading: "112",
    collection: "96",
    headImgSrc: "/images/post/crab.png",
    author: "林白衣",
    dateTime: "24小时前",
    detail: "生活不如意十之八九，有阴就有晴，有得到就有失去，有快乐也有不快乐，我们在这种种复杂中，如果深陷其中，就会迷失自我，只有提高自己的高度，让自己在生活的淬炼中，修炼自己的内心，不与乱事乱人纠结，尽量和正能量积极的人交往，让自己时刻保持一种旺盛的状态，时刻让自己处于一种最佳的状态中，那么，生活的美尽向你绽放。有时，我们难过了，可以允许自己难过一会儿，但是不允许自己自此就沉沦其中，生活有许多切片，这片窗户看到的是小狗死掉，另一扇窗户也许就是鲜花盛开。因此，适时的切换频道和状态，是对自己的把控力的锻炼，这一点很重要。人生不可能没有遗憾，没有遗憾的人生就是一种遗憾，我们所要做的就是正确心态和方式处理这些遗憾，收拾好自己的心情，轻装上阵，走更远的路看更大的海。既要学会放下心中的执念，又要对得起自己的不干心，因为我们放下的是不可能得到的东西，我们的不干心，是对自己生命的负责。有时，我们边走边泪，心中曾经认为的不可能，都成为了可能，而那些遥不可及的目标，都成为了身后的风景。你若盛开，花蝶自来，你若精彩，天自安排，有时，我们缺少的只是一种自我精彩的勇气，明明可以让自己变得更好，可是放弃了机会，明明可以证明自己，却缺少了勇气。很多时候，不是我们不行，而是我们不敢去想，不敢去试，害怕失败比失败本身这件事更值得可怕。其实我们每个人都可以发掘更好的自己，做最好的自己，只是我们失去了自我探索的能力。那些朝九晚五的安稳让我们迷离，那些灯红酒绿的诱惑让我们沉沦，那些纷繁复杂的人情让我们疲惫，那些狐朋狗友的“情谊”让我们纷乱，我们只是一个被欲望驱使的奴隶，而不是主宰欲望的主人，当一个人能够正确处理自己的欲望和生活琐事，那么，这才是一个最好的自己。而最好的自己往往极其简单的，生活俭朴，不乱于心，不困于情，时刻保持一种轻盈的状态，对突如其来的事，往往有很好的把控力，决不会被自己的欲望所吞没，神清目明，心中有爱，疏而不离，淡泊如水……",
    postId: 0,
    music: {
        url: "http://www.ytmp3.cn/down/48839.mp3",
      title: "李泉-再见忧伤",
      coverImg: "http://oeff2vktt.bkt.clouddn.com/image/10.jpg"
    }
  },
  {
    title: "比利·林恩的中场故事",
    content: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。",
    imgSrc: "/images/post/bl.png",
    reading: 62,
    detail: "一 “李安是一位绝不会重复自己的导演，本片将极富原创性”李安众所瞩目的新片《比利林恩漫长的中场休息》，正式更名《半场无战事》。预告片首次曝光后，被视作是明年奥斯卡种子选手。该片根据同名畅销书改编。原著小说荣获美国国家图书奖。也被BBC评为21世纪最伟大的12本英文小说之一。影片讲述一位19岁德州男孩的比利·林恩入伍参加伊战，在一次交火中他大难不死，意外与战友成为大众的关注焦点，并被塑造成英雄。之后他们返回国内，在橄榄球赛中场休息时授勋。这名战争英雄却面临前所未有的心灵煎熬……李安为什么选中这部电影来拍？因为李安想要挑战前所未有的技术难题：以120帧每秒的速度、4K、3D技术全面结合，来掀起一场电影视觉革命。什么意思？所谓“电影是24格每秒的谎言”，其中的24格，就是帧数。",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/post/bl.png",
    author: "迷的城",
    date: "Nov 20 2016",
    avatar: "/images/avatar/1.png",
    postId: 1,
    music: {
        url: "http://www.ytmp3.cn/down/48813.mp3",
        title: "鹿晗-超级冠军",
        coverImg: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1531302992236&di=cba9c3292360372f84b361904491b6f0&imgtype=0&src=http%3A%2F%2Fhimg2.huanqiu.com%2Fattachment2010%2F2017%2F0206%2F20170206023806892.jpg"
    }
  },
  {
    //按住alt + shift + F 可以格式化代码样式
      title: "毛泽东未了的黄河情结",
      content: "伟大领袖的黄河之行，曾使多少人心潮激荡，夜不能寐！...",
      detail: "毛泽东觉得再也不能这样继续下去了，也许这正是他要走出丰泽园，走出菊香书屋，凭借黄河再度“突围”的真正含义。1964年8月初，平阔恬静的北戴河浴场突然传来一阵军马嘶鸣之声，一支由中共中央警卫局局长汪东兴精心组建的骑兵大队，在北京西郊香山经过特殊训练后，奉调紧急赶至北戴河海滨。年逾古稀的毛泽东，在卫士簇拥下登上一匹专门挑选的白色高头大马。他昂首挺胸，挽缰策马，行进在金色的沙滩上，一如当年“屈指行程二万”之风采再现。“练吧，不会骑马就去不了黄河。如果人生连黄河都没有见过，那是会后悔的。”毛泽东语重心长地鼓励身边工作人员。然而，就在这时，一场“千里走黄河”的壮行却注定要搁浅了。因为毛泽东感到中国已经出了修正主义。1964年12月26日，是毛泽东的71岁生日。他在人民大会堂订了几桌菜，请部分中央领导人，各大区主要负责人以及少数劳动模范、科学家一起过生日。宴前，毛泽东即席讲话“今天不是做生日，也不是祝寿，我用自己的稿费请大家吃顿饭……什么四清四不清，什么党内外矛盾交叉？这是非马克思主义的，党内有产生修正主义的危险……你们什么事情都不给我讲，有人搞独立王国，尾巴翘得很高。”一顿寿宴大家吃得索然无味。中国出现修正主义，当然要比千里走黄河重要。于是，黄河骑兵大队很快就宣布解散。一场最高规格的“黄河壮行计划”无果而终。不过，即使在轰轰烈烈的“文化大革命”中，毛泽东也没有忘记黄河的事情。1972年他大病初愈，在接见美国总统尼克松时还曾风趣地说“前些时候我到马克思、列宁那里去了一趟。他俩对我说，你那个国家的钢铁、粮食还太少，再说你还要去黄河，你不用来这么早了。你先回去吧。看来我的一片真诚感动了马克思和列宁，去黄河还是有希望的……”黄河啊，这是毛泽东魂牵梦绕的一条大河！",
    imgSrc: "/images/post/sls.jpg",
    headImgSrc: "/images/post/sls.jpg",
    reading: 62,
    collection: 92,
    author: "知乎",
    date: "Nov 12 2016",
    dateTime: "三天前",
    avatar: "/images/avatar/3.png",
    postId: 2,
    music: {
        url: "http://www.ytmp3.cn/down/48812.mp3",
        title: "孙露 - 离别的车站",
        coverImg: "http://oeff2vktt.bkt.clouddn.com/image/7.jpg"
    }
  },
  {
    title: "微信·小程序开发工具安装指南",
    content: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序",
    imgSrc: "/images/post/xiaolong.jpg",
    reading: 102,
    detail: "这两天闲来无事，也安装了 “微信折叠”的开发工具来玩一下。以下是一些小道消息及使用体验，过两天我会写一篇文章以开发者的角度来详细评价微信小程序:微信小程序不能开发游戏类、直播类功能，小程序每个人关注的上限是20个（还不确定，不过我相信这是真的，这次公布的API里并没有视频组件。微信太大，苹果要有所顾忌，但是微信也要做出相应的让步)微信目前有没有同苹果商谈好，还是个未知数，毕竟会对AppStore有一定的冲击。抛弃了大量的javascript组件后，这个生态体系变得相当的封闭，微信解释肯定是：为了更好的性能提升。那么我们拭目以待。小程序的入口是微信里的三级菜单，就是在“Tab栏发现里的游戏下面加入一个“小程序”。反正，这一栏里的购物和游戏我是从来没点进去过的。以腾讯的尿性，小程序同服务号一样，其关系链及重要功能的开放程度会因“人”而异。对，优质的接口只会开放给腾讯的儿子们（滴滴呀、京东呀）",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/post/xiaolong.jpg",
    author: "猫是猫的猫",
    date: "Nov 20 2016",
    avatar: "/images/avatar/5.png",
    postId: 3,
    music: {
        url: "http://www.ytmp3.cn/down/48807.mp3",
        title: "晨熙 - 等你一生够不够",
        coverImg: "http://oeff2vktt.bkt.clouddn.com/image/15.jpg"
    }
  },
  {
    title: "从视觉到触觉 这款VR手套能给你真实触感",
    content: "8月29日消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品",
    imgSrc: "/images/post/vr.png",
    reading: 102,
    detail: "消息，据国外媒体VentureBeat报道，一家名为Dexta Robotics的公司最近发布了一款有望变革虚拟现实手部追踪与交互方式的新产品。该产品名为“Dexmo”，它是一款像手套那样戴在手上使用的未来主义外骨骼。它内置大量的元件，能够与VR体验进行交互，可帮助你感觉握在你的双手的虚拟物体。Dexmo据Dexta称，“Dexmo是一款针对你的双手的机械外骨骼。它能够捕捉你的手部运动，以及提供即时的力反馈。有了Dexmo，你可以感受到虚拟物体的大小、形状和坚硬度。你可以接触数字世界。”市面上已经有数款产品旨在处理虚拟现实中的手部交互，也有相关的产品即将要进入市场。例如，颇受欢迎的HTC Vive头盔配有一副控制器，其控制器能够使得追踪系统看到你的双手，让你可以用它们来在特定体验中与物体进行交互。今年晚些时候，Oculus将开始出货类似的手部控制产品Oculus Touch。10月，索尼也将开始出货配备两个PlayStation Move手部控制器的PS VR。Leap Motion甚至更进一步：利用传感器来追踪手指和手部的运动。",
    collection: 26,
    dateTime: "24小时前",
    headImgSrc: "/images/post/vr.png",
    author: "深白色",
    date: "Nov 20 2016",
    avatar: "../../../images/avatar/3.png",
    postId: 4,
    music: {
        url: "http://www.ytmp3.cn/down/48795.mp3",
        title: "为了遇见你-薛之谦",
        coverImg: "http://oeff2vktt.bkt.clouddn.com/image/49.jpg"
    }
  },
  {
    title: "爱奇艺创维开展战略合作，合力布局开放娱乐生态",
    content: "爱奇艺和创维分别作为国内领先的在线视频品牌",
    imgSrc: "/images/001.jpg",
    reading: 96,
    detail: "爱奇艺和创维分别作为国内领先的在线视频品牌和家电品牌。双方一直锐意创新，为用户提供优质的服务体验和产品体验。据悉，爱奇艺与创维将展开从资本到VIP会员服务等各方面的深入合作。籍由此次合作，爱奇艺将战略投资创维旗下拥有高端互联网电视品牌的酷开公司。从下一财年开始，创维旗下互联网电视将通过银河互联网电视集成播控平台，预置VIP会员服务及相关内容。这种捆绑终端与VIP内容的全新销售模式，将大幅提升互联网电视终端用户的体验，给予用户更多优质内容的选择。",
    collection: 26,
    dateTime: "21小时前",
    headImgSrc: "/images/001.jpg",
    author: "深白色",
    date: "Nov 20 2016",
    avatar: "../../../images/avatar/5.png",
    postId: 5,
    music: {
        url: "http://sc1.111ttt.cn:8282/2018/1/03m/13/396131232171.m4a?tflag=1519095601&pin=6cd414115fdb9a950d827487b16b5f97#.mp3",
        title: "夜夜夜夜-齐秦",
        coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
    }
  },
]

module.exports = {
  postList: local_database
}